benchmark/jmeter/tcc-order-show-v1.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="TCC GET logical order 1 v1" enabled="true">
      <stringProp name="TestPlan.comments">Version 1 frozen thesis plan. HTTP/1.1, keep-alive, no TLS, no load-generator retry.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TCC order-show" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration_seconds,120)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Frozen request headers" enabled="true">
          <collectionProp name="HeaderManager.headers"><elementProp name="Accept" elementType="Header"><stringProp name="Header.name">Accept</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="${__P(tcc.auth.header.name)}" elementType="Header"><stringProp name="Header.name">${__P(tcc.auth.header.name)}</stringProp><stringProp name="Header.value">${__P(tcc.auth.header.value)}</stringProp></elementProp></collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET logical order 1" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(target_host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target_port)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/orders/${__P(tcc.order.id)}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="required-status">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Semantic JSON contract" enabled="true">
            <stringProp name="cacheKey">tcc-order-show-semantic-v1</stringProp>
            <stringProp name="script">def require = { condition, message -&gt;
    if (!condition) {
        throw new AssertionError(message)
    }
}

try {
    def root = new groovy.json.JsonSlurper().parseText(prev.getResponseDataAsString())
    require(root instanceof Map, 'response root must be an object')
    require(root.data instanceof Map, 'data must be an object')
    require(root.data.id.toString() == props.getProperty('tcc.order.id'), 'physical order ID must match logical-order-1 mapping')
    require(root.data.user_id.toString() == '1', 'order must belong to logical user 1')
    require(root.data.status == 'pending', 'logical order 1 status must be pending')
    require(root.data.total_price.toString() == '120.50', 'logical order 1 total must be 120.50')
    require(root.data.items instanceof List &amp;&amp; root.data.items.size() == 2, 'logical order 1 must have two items')
    require(root.data.items[0].product_id.toString() == '1' &amp;&amp; root.data.items[0].quantity.toString() == '1', 'first item must be product 1 quantity 1')
    require(root.data.items[1].product_id.toString() == '38' &amp;&amp; root.data.items[1].quantity.toString() == '2', 'second item must be product 38 quantity 2')
} catch (Throwable failure) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('order-show semantic assertion: ' + failure.getMessage())
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>